lbw14514/esp8266-ddns-console/src/main.cpp
#include <Arduino.h>
#include <EEPROM.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <ESP8266Ping.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClientSecureBearSSL.h>
#include <ArduinoJson.h>
#include <bearssl/bearssl_hmac.h>
#include <bearssl/bearssl_hash.h>
#include <stddef.h>
#include <time.h>
#include "web_ui.h"
#include "tls_roots.h"

namespace {
constexpr uint32_t CONFIG_MAGIC = 0x4553503C;
constexpr size_t EEPROM_SIZE = 4096;
constexpr uint16_t WIFI_CONNECT_TIMEOUT_MS = 15000;
constexpr uint32_t WIFI_RETRY_INTERVAL_MS = 15000;
constexpr uint32_t PORTAL_FALLBACK_DELAY_MS = 5000;
constexpr uint32_t PORTAL_HOLD_MS = 600000;
constexpr uint32_t RESTART_DELAY_MS = 900;
constexpr size_t AP_PASSWORD_MIN_LENGTH = 8;
constexpr size_t STREAM_CHUNK_SIZE = 448;
constexpr size_t STREAM_LOOKAHEAD_SIZE = 32;
constexpr size_t MAX_PAGE_TOKENS = 48;
constexpr size_t MAX_SCAN_RESULTS = 24;
constexpr uint16_t DEFAULT_WEB_PORT = 80;
constexpr uint32_t DEFAULT_DDNS_INTERVAL_SEC = 600;
constexpr uint32_t DEFAULT_DDNS_RETRY_SEC = 60;
constexpr uint32_t DEFAULT_DDNS_FORCE_SEC = 86400;
constexpr uint32_t DDNS_INTERVAL_MIN_SEC = 10;
constexpr uint32_t DDNS_INTERVAL_MAX_SEC = 604800;
constexpr uint32_t DDNS_RETRY_MIN_SEC = 10;
constexpr uint32_t DDNS_RETRY_MAX_SEC = 3600;
constexpr uint32_t DDNS_FORCE_MIN_SEC = 600;
constexpr uint32_t DDNS_FORCE_MAX_SEC = 2592000;
constexpr time_t MIN_VALID_EPOCH = 1000000000;
constexpr uint16_t SETUP_AP_CHANNEL_DELAY_MS = 300;
constexpr char CLEAR_SECRET_VALUE[] = "-";
constexpr char SETUP_AP_SSID[] = "ESP8266-Setup";
constexpr char DDNS_GET[] = "GET";
constexpr char DDNS_POST[] = "POST";
const char ALIYUN_API_HOST[] = "https://alidns.aliyuncs.com/?";
const char ALIYUN_API_VERSION[] = "2015-01-09";
const char ALIYUN_RR_DEFAULT[] = "@";
const char DNSPOD_API_HOST[] = "https://dnspod.tencentcloudapi.com";
const char DNSPOD_API_NAME[] = "dnspod.tencentcloudapi.com";
const char DNSPOD_SERVICE[] = "dnspod";
const char DNSPOD_API_VERSION[] = "2021-03-23";
const char CALLBACK_RECORD_TYPE[] = "A";
const char CALLBACK_RECORD_TTL[] = "600";
const char* const DDNS_PROVIDERS[] = {"generic", "aliyun", "cloudflare", "dnspod"};
const char* const DDNS_RECORD_TYPES[] = {"A", "AAAA", "CNAME"};
const char* const NTP_SERVERS[] = {"pool.ntp.org", "time.nist.gov"};

const char* const DEFAULT_PUBLIC_IP_APIS[] = {
  "https://api.ipify.org",
  "https://checkip.amazonaws.com",
  "https://ipv4.icanhazip.com",
  "https://ifconfig.me/ip"
};
constexpr size_t DEFAULT_PUBLIC_IP_API_COUNT = sizeof(DEFAULT_PUBLIC_IP_APIS) / sizeof(DEFAULT_PUBLIC_IP_APIS[0]);

struct DeviceConfig {
  uint32_t magic;
  char wifiSsid[33];
  char wifiPassword[65];
  char staticIp[16];
  char gateway[16];
  char subnet[16];
  char dns[16];
  char ddnsHostname[96];
  char ddnsUsername[48];
  char ddnsPassword[64];
  char ddnsUrl[192];
  char ddnsProvider[16];
  char aliyunAccessKeyId[64];
  char aliyunAccessKeySecret[96];
  char aliyunDomainName[96];
  char aliyunRR[64];
  char aliyunType[8];
  char cloudflareApiToken[96];
  char cloudflareZoneId[40];
  char cloudflareRecordId[40];
  char tencentSecretId[64];
  char tencentSecretKey[96];
  char tencentDomain[96];
  char tencentSubDomain[64];
  char tencentRecordType[8];
  char ddnsIpUrl[128];
  char ddnsSuccess[32];
  char ddnsMethod[8];
  char ddnsBody[256];
  char ddnsHeaders[256];
  char apPassword[65];
  uint32_t ddnsIntervalSec;
  uint32_t ddnsRetrySec;
  uint32_t ddnsForceSec;
  uint16_t webPort;
  uint8_t tlsInsecure;
  uint32_t crc;
};

enum class ConnectJob : uint8_t { None, Probe, Save };

struct ConnectAttempt {
  ConnectJob job = ConnectJob::None;
  uint32_t startedAt = 0;
  uint32_t restartAt = 0;
  bool active = false;
  bool resultReady = false;
  bool succeeded = false;
  bool dhcpAddresses = false;
};

DeviceConfig config{};
DeviceConfig pendingConfig{};
ConnectAttempt connectAttempt;
ESP8266WebServer dashboardServer(DEFAULT_WEB_PORT);
ESP8266WebServer apServer(DEFAULT_WEB_PORT);
bool setupPortalActive = false;
bool serverStarted = false;
bool apRoutesReady = false;
bool dashboardRoutesReady = false;
uint32_t lastWifiRetry = 0;
uint32_t portalHoldUntil = 0;
String currentDdnsIp;
String lastDdnsIp;
uint32_t lastDdnsSync = 0;
uint32_t nextDdnsAttempt = 0;
BearSSL::X509List* trustAnchors = nullptr;

BearSSL::X509List* getTrustAnchors() {
  if (trustAnchors == nullptr) {
    trustAnchors = new BearSSL::X509List(TLS_ROOT_CA_BUNDLE);
  }
  return trustAnchors;
}

void configureSecureClient(BearSSL::WiFiClientSecure& client) {
  if (config.tlsInsecure) {
    client.setInsecure();
    return;
  }
  client.setTrustAnchors(getTrustAnchors());
}

bool copyText(char* target, size_t targetSize, const String& value) {
  bool fits = value.length() + 1 <= targetSize;
  if (!fits) {
    Serial.printf("字段超长已截断: %u -> %u\n",
                  static_cast<unsigned>(value.length()),
                  static_cast<unsigned>(targetSize - 1));
  }
  value.toCharArray(target, targetSize);
  return fits;
}

void applySecretValue(char* field, size_t size, const String& submitted) {
  String value = submitted;
  value.trim();
  if (value.length() == 0) {
    return;
  }
  if (value == CLEAR_SECRET_VALUE) {
    copyText(field, size, "");
    return;
  }
  copyText(field, size, value);
}

bool isAllowedValue(const char* value, const char* const* allowed, size_t count) {
  for (size_t index = 0; index < count; index++) {
    if (strcmp(value, allowed[index]) == 0) {
      return true;
    }
  }
  return false;
}

void normalizeProvider(char* provider, size_t size) {
  if (!isAllowedValue(provider, DDNS_PROVIDERS, sizeof(DDNS_PROVIDERS) / sizeof(DDNS_PROVIDERS[0]))) {
    copyText(provider, size, DDNS_PROVIDERS[0]);
  }
}

void normalizeRecordType(char* recordType, size_t size) {
  if (!isAllowedValue(recordType, DDNS_RECORD_TYPES, sizeof(DDNS_RECORD_TYPES) / sizeof(DDNS_RECORD_TYPES[0]))) {
    copyText(recordType, size, CALLBACK_RECORD_TYPE);
  }
}

bool isCallbackRecordType(const char* recordType) {
  return strcmp(recordType, CALLBACK_RECORD_TYPE) == 0;
}

bool parsePort(const String& text, uint16_t& port) {
  String value = text;
  value.trim();
  if (value.length() == 0) {
    return false;
  }
  for (size_t index = 0; index < value.length(); index++) {
    if (!isDigit(value[index])) {
      return false;
    }
  }
  long parsed = value.toInt();
  if (parsed < 1 || parsed > 65535) {
    return false;
  }
  port = static_cast<uint16_t>(parsed);
  return true;
}

uint32_t randomWord() {
  return RANDOM_REG32;
}

String makeNonce() {
  String nonce(ESP.getChipId(), HEX);
  nonce += '-'; nonce += String(randomWord(), HEX);
  nonce += '-'; nonce += String(micros(), HEX);
  nonce += '-'; nonce += String(ESP.getCycleCount(), HEX);
  return nonce;
}

void startClock() {
  configTime(0, 0, NTP_SERVERS[0], NTP_SERVERS[1]);
}

