lbw14514/esp8266-ddns-console/src/main.cpp
uint32_t crc32Of(const uint8_t* data, size_t length) {
  uint32_t crc = 0xFFFFFFFF;
  for (size_t index = 0; index < length; index++) {
    crc ^= data[index];
    for (uint8_t bit = 0; bit < 8; bit++) {
      crc = (crc >> 1) ^ (0xEDB88320 & (0 - (crc & 1)));
    }
  }
  return ~crc;
}

uint32_t configChecksum() {
  return crc32Of(reinterpret_cast<const uint8_t*>(&config), offsetof(DeviceConfig, crc));
}

bool saveConfig();

void setDefaults() {
  memset(&config, 0, sizeof(config));
  config.magic = CONFIG_MAGIC;
  copyText(config.staticIp, sizeof(config.staticIp), "192.168.1.50");
  copyText(config.gateway, sizeof(config.gateway), "192.168.1.1");
  copyText(config.subnet, sizeof(config.subnet), "255.255.255.0");
  copyText(config.dns, sizeof(config.dns), "8.8.8.8");
  copyText(config.ddnsProvider, sizeof(config.ddnsProvider), "generic");
  copyText(config.aliyunRR, sizeof(config.aliyunRR), "@");
  copyText(config.aliyunType, sizeof(config.aliyunType), "A");
  copyText(config.tencentRecordType, sizeof(config.tencentRecordType), "A");
  copyText(config.ddnsIpUrl, sizeof(config.ddnsIpUrl), DEFAULT_PUBLIC_IP_APIS[0]);
  copyText(config.ddnsMethod, sizeof(config.ddnsMethod), DDNS_GET);
  config.ddnsIntervalSec = DEFAULT_DDNS_INTERVAL_SEC;
  config.ddnsRetrySec = DEFAULT_DDNS_RETRY_SEC;
  config.ddnsForceSec = DEFAULT_DDNS_FORCE_SEC;
  config.webPort = DEFAULT_WEB_PORT;
  config.tlsInsecure = 0;
}

bool configRangeValid() {
  return config.ddnsIntervalSec >= DDNS_INTERVAL_MIN_SEC && config.ddnsIntervalSec <= DDNS_INTERVAL_MAX_SEC &&
         config.ddnsRetrySec >= DDNS_RETRY_MIN_SEC && config.ddnsRetrySec <= DDNS_RETRY_MAX_SEC &&
         config.ddnsForceSec >= DDNS_FORCE_MIN_SEC && config.ddnsForceSec <= DDNS_FORCE_MAX_SEC &&
         config.webPort != 0;
}

bool loadConfig() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.get(0, config);
  if (config.magic != CONFIG_MAGIC || config.crc != configChecksum() || !configRangeValid()) {
    Serial.println("配置无效或已损坏，恢复默认值");
    setDefaults();
    saveConfig();
    return false;
  }
  normalizeProvider(config.ddnsProvider, sizeof(config.ddnsProvider));
  normalizeRecordType(config.aliyunType, sizeof(config.aliyunType));
  normalizeRecordType(config.tencentRecordType, sizeof(config.tencentRecordType));
  if (strcasecmp(config.ddnsMethod, DDNS_POST) != 0) {
    copyText(config.ddnsMethod, sizeof(config.ddnsMethod), DDNS_GET);
  }
  return true;
}

bool saveConfig() {
  config.magic = CONFIG_MAGIC;
  config.crc = configChecksum();
  EEPROM.put(0, config);
  if (EEPROM.commit()) {
    return true;
  }
  Serial.println("配置写入 EEPROM 失败");
  return false;
}

bool parseIp(const char* text, IPAddress& address) {
  return address.fromString(text);
}

bool configureStaticIp() {
  IPAddress ip;
  IPAddress gateway;
  IPAddress subnet;
  IPAddress dns;
  if (!parseIp(config.staticIp, ip) || !parseIp(config.gateway, gateway) ||
      !parseIp(config.subnet, subnet) || !parseIp(config.dns, dns)) {
    return false;
  }
  return WiFi.config(ip, gateway, subnet, dns);
}

uint32_t ipToNumber(const IPAddress& address) {
  return (static_cast<uint32_t>(address[0]) << 24) |
         (static_cast<uint32_t>(address[1]) << 16) |
         (static_cast<uint32_t>(address[2]) << 8) |
         address[3];
}

IPAddress numberToIp(uint32_t value) {
  return IPAddress((value >> 24) & 0xff, (value >> 16) & 0xff,
                   (value >> 8) & 0xff, value & 0xff);
}

bool findAvailableIp(IPAddress& selectedIp) {
  IPAddress preferredIp;
  IPAddress gateway;
  IPAddress subnet;
  IPAddress dns;
  if (!parseIp(config.staticIp, preferredIp) || !parseIp(config.gateway, gateway) ||
      !parseIp(config.subnet, subnet) || !parseIp(config.dns, dns)) {
    return false;
  }
  uint32_t network = ipToNumber(preferredIp) & ipToNumber(subnet);
  uint32_t broadcast = network | ~ipToNumber(subnet);
  uint32_t candidate = ipToNumber(preferredIp);
  if (candidate <= network || candidate >= broadcast) {
    candidate = network + 1;
  }
  while (candidate < broadcast) {
    IPAddress candidateIp = numberToIp(candidate);
    if (candidateIp == WiFi.localIP() || !Ping.ping(candidateIp, 1)) {
      selectedIp = candidateIp;
      return true;
    }
    Serial.printf("IP %s 已占用，顺延测试\n", candidateIp.toString().c_str());
    candidate++;
  }
  return false;
}

bool connectWithAvailableStaticIp() {
  IPAddress selectedIp;
  if (!findAvailableIp(selectedIp)) {
    return false;
  }
  if (selectedIp.toString() != String(config.staticIp)) {
    Serial.printf("静态 IP 冲突，改用 %s\n", selectedIp.toString().c_str());
    copyText(config.staticIp, sizeof(config.staticIp), selectedIp.toString());
    saveConfig();
  }
  WiFi.disconnect();
  delay(100);
  if (!configureStaticIp()) {
    return false;
  }
  WiFi.begin(config.wifiSsid, config.wifiPassword);
  uint32_t startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < WIFI_CONNECT_TIMEOUT_MS) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();
  return WiFi.status() == WL_CONNECTED;
}

String htmlEscape(const String& value) {
  String escaped;
  escaped.reserve(value.length() + 16);
  for (size_t index = 0; index < value.length(); index++) {
    switch (value[index]) {
      case '&': escaped += F("&amp;"); break;
      case '<': escaped += F("&lt;"); break;
      case '>': escaped += F("&gt;"); break;
      case '"': escaped += F("&quot;"); break;
      case '\'': escaped += F("&#39;"); break;
      default: escaped += value[index];
    }
  }
  return escaped;
}

void redirectToRoot(ESP8266WebServer& target) {
  target.sendHeader("Location", "http://" + WiFi.softAPIP().toString() + "/", true);
  target.sendHeader("Cache-Control", "no-store");
  target.send(302, "text/plain", "");
}

void sendJson(ESP8266WebServer& target, int code, const String& body) {
  target.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  target.send(code, "application/json", body);
}

String escapeJson(const String& value);

