lbw14514/esp8266-ddns-console/src/main.cpp
void appendNetworkAddresses(String& json) {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  json += ",\"ssid\":\"" + escapeJson(WiFi.SSID()) + "\"";
  json += ",\"ip\":\"" + WiFi.localIP().toString() + "\"";
  json += ",\"gateway\":\"" + WiFi.gatewayIP().toString() + "\"";
  json += ",\"subnet\":\"" + WiFi.subnetMask().toString() + "\"";
  json += ",\"dns\":\"" + WiFi.dnsIP().toString() + "\"";
  json += ",\"rssi\":" + String(WiFi.RSSI());
}

String currentNetworkJson(bool ok) {
  String json = "{\"ok\":";
  json += ok ? "true" : "false";
  if (ok) {
    appendNetworkAddresses(json);
  }
  json += "}";
  return json;
}

void applyDhcpAddresses() {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  IPAddress ip = WiFi.localIP();
  if (static_cast<uint32_t>(ip) != 0) {
    copyText(config.staticIp, sizeof(config.staticIp), ip.toString());
  }
  IPAddress gateway = WiFi.gatewayIP();
  if (static_cast<uint32_t>(gateway) != 0) {
    copyText(config.gateway, sizeof(config.gateway), gateway.toString());
  }
  IPAddress subnet = WiFi.subnetMask();
  if (static_cast<uint32_t>(subnet) != 0) {
    copyText(config.subnet, sizeof(config.subnet), subnet.toString());
  }
  IPAddress dns = WiFi.dnsIP();
  if (static_cast<uint32_t>(dns) != 0) {
    copyText(config.dns, sizeof(config.dns), dns.toString());
  }
}

void fillInvalidAddress(char* field, size_t size, IPAddress value) {
  IPAddress parsed;
  if (static_cast<uint32_t>(value) == 0) {
    return;
  }
  String text = field;
  text.trim();
  if (text.length() == 0 || !parseIp(field, parsed)) {
    copyText(field, size, value.toString());
  }
}

void applyAddressFallback() {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  fillInvalidAddress(config.staticIp, sizeof(config.staticIp), WiFi.localIP());
  fillInvalidAddress(config.gateway, sizeof(config.gateway), WiFi.gatewayIP());
  fillInvalidAddress(config.subnet, sizeof(config.subnet), WiFi.subnetMask());
  fillInvalidAddress(config.dns, sizeof(config.dns), WiFi.dnsIP());
}

String messageBlock(const String& message, const char* kind = "") {
  if (message.length() == 0) {
    return "";
  }
  return "<div class=\"alert " + String(kind) + "\">" + htmlEscape(message) + "</div>";
}

struct PageToken {
  const char* key;
  String value;
};

struct TokenCollector {
  PageToken* tokens;
  size_t count;
  size_t capacity;
};

void replaceAll(TokenCollector& collector, const char* key, const String& value) {
  if (collector.count >= collector.capacity) {
    Serial.printf("页面占位符超出容量，已忽略: %s\n", key);
    return;
  }
  collector.tokens[collector.count].key = key;
  collector.tokens[collector.count].value = value;
  collector.count++;
}

size_t matchingTokenLength(const char* text, size_t length, const PageToken* tokens, size_t count) {
  for (size_t index = 0; index < count; index++) {
    size_t keyLength = strlen(tokens[index].key);
    if (length >= keyLength && memcmp(tokens[index].key, text, keyLength) == 0) {
      return keyLength;
    }
  }
  return 0;
}

const char PAGE_HEAD[] PROGMEM = "<!doctype html><html lang=\"zh-CN\"><head><meta charset=\"utf-8\"><meta name=\"viewport\" content=\"width=device-width,initial-scale=1\"><title>ESP8266 Core</title><style>";
const char PAGE_STYLE_END[] PROGMEM = "</style><script>";
const char PAGE_BODY_OPEN[] PROGMEM = "</script></head><body>";
const char PAGE_END[] PROGMEM = "</body></html>";

size_t streamSection(ESP8266WebServer* target, const char* section, const PageToken* tokens, size_t count) {
  size_t total = strlen_P(reinterpret_cast<PGM_P>(section));
  if (count == 0) {
    if (target != nullptr) {
      target->sendContent_P(section);
    }
    return total;
  }
  const size_t chunkSize = STREAM_CHUNK_SIZE;
  const size_t lookSize = STREAM_LOOKAHEAD_SIZE;
  char buffer[STREAM_CHUNK_SIZE + STREAM_LOOKAHEAD_SIZE];
  size_t position = 0;
  size_t written = 0;
  while (position < total) {
    size_t want = total - position;
    if (want > chunkSize) {
      want = chunkSize;
    }
    size_t look = total - position - want;
    if (look > lookSize) {
      look = lookSize;
    }
    size_t available = want + look;
    memcpy_P(buffer, section + position, available);
    size_t cut = want;
    size_t windowStart = want > lookSize ? want - lookSize : 0;
    for (size_t index = want; index-- > windowStart;) {
      if (buffer[index] == '_' && buffer[index + 1] == '_') {
        if (index > 0) {
          size_t keyLength = matchingTokenLength(buffer + index, available - index, tokens, count);
          if (keyLength > 0 && index + keyLength > want) {
            cut = index;
          }
        }
        break;
      }
    }
    String chunk;
    chunk.reserve(cut + 1);
    chunk.concat(buffer, static_cast<unsigned int>(cut));
    for (size_t index = 0; index < count; index++) {
      if (chunk.indexOf(tokens[index].key) >= 0) {
        chunk.replace(tokens[index].key, tokens[index].value);
      }
    }
    if (target != nullptr) {
      target->sendContent(chunk);
    }
    written += chunk.length();
    position += cut;
  }
  return written;
}

size_t measurePage(const char* body, const PageToken* tokens, size_t count) {
  size_t length = strlen_P(reinterpret_cast<PGM_P>(PAGE_HEAD));
  length += strlen_P(reinterpret_cast<PGM_P>(WEB_STYLE));
  length += strlen_P(reinterpret_cast<PGM_P>(PAGE_STYLE_END));
  length += strlen_P(reinterpret_cast<PGM_P>(WEB_SCRIPT));
  length += strlen_P(reinterpret_cast<PGM_P>(PAGE_BODY_OPEN));
  length += streamSection(nullptr, body, tokens, count);
  length += strlen_P(reinterpret_cast<PGM_P>(PAGE_END));
  return length;
}

void sendHtmlPage(ESP8266WebServer& target, int code, const char* body, const PageToken* tokens, size_t count) {
  target.sendHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  target.sendHeader("Pragma", "no-cache");
  target.sendHeader("Expires", "0");
  target.setContentLength(measurePage(body, tokens, count));
  target.send(code, "text/html; charset=utf-8", "");
  streamSection(&target, PAGE_HEAD, nullptr, 0);
  streamSection(&target, WEB_STYLE, nullptr, 0);
  streamSection(&target, PAGE_STYLE_END, nullptr, 0);
  streamSection(&target, WEB_SCRIPT, nullptr, 0);
  streamSection(&target, PAGE_BODY_OPEN, nullptr, 0);
  streamSection(&target, body, tokens, count);
  streamSection(&target, PAGE_END, nullptr, 0);
}

void clearConnectResult() {
  if (connectAttempt.active) {
    return;
  }
  connectAttempt.job = ConnectJob::None;
  connectAttempt.resultReady = false;
  connectAttempt.succeeded = false;
  connectAttempt.restartAt = 0;
}

const char* connectStateName() {
  if (connectAttempt.active) {
    return "pending";
  }
  if (!connectAttempt.resultReady) {
    return "idle";
  }
  return connectAttempt.succeeded ? "ok" : "fail";
}

