lbw14514/esp8266-ddns-console/src/main.cpp
String connectStateJson() {
  String json = "{\"state\":\"";
  json += connectStateName();
  json += "\",\"job\":\"";
  switch (connectAttempt.job) {
    case ConnectJob::Probe: json += "probe"; break;
    case ConnectJob::Save: json += "save"; break;
    default: json += "none"; break;
  }
  json += "\"";
  if (!connectAttempt.active && connectAttempt.resultReady && connectAttempt.succeeded) {
    appendNetworkAddresses(json);
  }
  json += "}";
  return json;
}

void beginConnectAttempt(ConnectJob job, bool dhcpAddresses) {
  connectAttempt.job = job;
  connectAttempt.startedAt = millis();
  connectAttempt.active = true;
  connectAttempt.resultReady = false;
  connectAttempt.succeeded = false;
  connectAttempt.dhcpAddresses = dhcpAddresses;
  connectAttempt.restartAt = 0;
  WiFi.mode(WIFI_AP_STA);
  WiFi.disconnect();
  delay(50);
  WiFi.begin(pendingConfig.wifiSsid, pendingConfig.wifiPassword);
}

void finishConnectAttempt() {
  connectAttempt.active = false;
  connectAttempt.resultReady = true;
  if (!connectAttempt.succeeded) {
    if (strlen(config.wifiSsid) > 0) {
      WiFi.begin(config.wifiSsid, config.wifiPassword);
    }
    Serial.println("WiFi 连接失败");
    return;
  }
  Serial.printf("WiFi 连接成功: %s\n", pendingConfig.wifiSsid);
  if (connectAttempt.job == ConnectJob::Probe) {
    portalHoldUntil = millis() + PORTAL_HOLD_MS;
    return;
  }
  if (connectAttempt.job == ConnectJob::Save) {
    config = pendingConfig;
    if (connectAttempt.dhcpAddresses) {
      applyDhcpAddresses();
      Serial.println("已按路由器分配的地址信息自动填写");
    } else {
      applyAddressFallback();
    }
    saveConfig();
    portalHoldUntil = millis() + 3000;
    connectAttempt.restartAt = millis() + 3000;
  }
}

void serviceConnectAttempt() {
  if (connectAttempt.active) {
    if (WiFi.status() == WL_CONNECTED && WiFi.SSID() == String(pendingConfig.wifiSsid)) {
      connectAttempt.succeeded = true;
      finishConnectAttempt();
    } else if (millis() - connectAttempt.startedAt >= WIFI_CONNECT_TIMEOUT_MS) {
      connectAttempt.succeeded = false;
      finishConnectAttempt();
    }
  }
  if (connectAttempt.restartAt != 0 && static_cast<int32_t>(millis() - connectAttempt.restartAt) >= 0) {
    ESP.restart();
  }
}

struct PageField {
  const char* token;
  const char* value;
};

void addEscapedFields(TokenCollector& page, const PageField* fields, size_t count) {
  for (size_t index = 0; index < count; index++) {
    replaceAll(page, fields[index].token, htmlEscape(fields[index].value));
  }
}

void sendDashboardPage(ESP8266WebServer& target, int code = 200, const String& message = "", const char* kind = "") {
  static PageToken tokens[MAX_PAGE_TOKENS];
  TokenCollector page = {tokens, 0, MAX_PAGE_TOKENS};
  const PageField fields[] = {
    {"__SSID__", config.wifiSsid},
    {"__IP__", config.staticIp},
    {"__GATEWAY__", config.gateway},
    {"__SUBNET__", config.subnet},
    {"__DNS__", config.dns},
    {"__HOSTNAME__", config.ddnsHostname},
    {"__DDNS_USERNAME__", config.ddnsUsername},
    {"__DDNS_URL__", config.ddnsUrl},
    {"__ALIYUN_ID__", config.aliyunAccessKeyId},
    {"__ALIYUN_DOMAIN__", config.aliyunDomainName},
    {"__ALIYUN_RR__", config.aliyunRR},
    {"__CF_ZONE__", config.cloudflareZoneId},
    {"__CF_RECORD__", config.cloudflareRecordId},
    {"__TX_ID__", config.tencentSecretId},
    {"__TX_DOMAIN__", config.tencentDomain},
    {"__TX_SUBDOMAIN__", config.tencentSubDomain},
    {"__IP_URL__", config.ddnsIpUrl},
    {"__SUCCESS__", config.ddnsSuccess},
    {"__BODY__", config.ddnsBody},
    {"__HEADERS__", config.ddnsHeaders},
  };
  bool connected = WiFi.status() == WL_CONNECTED;
  replaceAll(page, "__MESSAGE__", messageBlock(message, kind));
  addEscapedFields(page, fields, sizeof(fields) / sizeof(fields[0]));
  replaceAll(page, "__AP_SSID__", SETUP_AP_SSID);
  replaceAll(page, "__STATUS__", connected ? "已连接" : "未连接");
  replaceAll(page, "__STATUS_KEY__", connected ? "val.on" : "val.off");
  replaceAll(page, "__LAN_IP__", WiFi.localIP().toString());
  replaceAll(page, "__PUBLIC_IP__", currentDdnsIp.length() ? currentDdnsIp : "未获取");
  replaceAll(page, "__WAN_KEY__", currentDdnsIp.length() ? "" : "val.none");
  replaceAll(page, "__PROVIDER__", htmlEscape(config.ddnsProvider));
  replaceAll(page, "__METHOD__", htmlEscape(config.ddnsMethod));
  replaceAll(page, "__ALIYUN_TYPE__", htmlEscape(config.aliyunType));
  replaceAll(page, "__TX_TYPE__", htmlEscape(config.tencentRecordType));
  replaceAll(page, "__PORT__", String(config.webPort));
  replaceAll(page, "__INTERVAL__", String(config.ddnsIntervalSec));
  replaceAll(page, "__RETRY__", String(config.ddnsRetrySec));
  replaceAll(page, "__FORCE__", String(config.ddnsForceSec));
  replaceAll(page, "__TLS_CHECKED__", config.tlsInsecure ? "" : " checked");
  sendHtmlPage(target, code, WEB_DASHBOARD_BODY, tokens, page.count);
}

void sendSetupPage(ESP8266WebServer& target, int code = 200, const String& message = "", const char* kind = "") {
  static PageToken tokens[MAX_PAGE_TOKENS];
  TokenCollector page = {tokens, 0, MAX_PAGE_TOKENS};
  const PageField fields[] = {
    {"__IP__", config.staticIp},
    {"__GATEWAY__", config.gateway},
    {"__SUBNET__", config.subnet},
    {"__DNS__", config.dns},
  };
  replaceAll(page, "__MESSAGE__", messageBlock(message, kind));
  addEscapedFields(page, fields, sizeof(fields) / sizeof(fields[0]));
  replaceAll(page, "__AP_SSID__", SETUP_AP_SSID);
  replaceAll(page, "__AP_IP__", WiFi.softAPIP().toString());
  replaceAll(page, "__SSID__", htmlEscape(config.wifiSsid));
  replaceAll(page, "__PORT__", String(config.webPort));
  replaceAll(page, "__CONNECT_STATE__", connectStateName());
  sendHtmlPage(target, code, WEB_SETUP_BODY, tokens, page.count);
}

String escapeJson(const String& value) {
  String escaped;
  escaped.reserve(value.length() + 8);
  for (size_t index = 0; index < value.length(); index++) {
    char character = value[index];
    if (character == '"' || character == '\\') {
      escaped += '\\';
      escaped += character;
      continue;
    }
    if (static_cast<uint8_t>(character) >= 0x20) {
      escaped += character;
    }
  }
  return escaped;
}

