lbw14514/esp8266-ddns-console/src/main.cpp
void handleApRoot() {
  clearConnectResult();
  sendSetupPage(apServer, 200);
}

String buildScanJson() {
  String json = "[";
  String seen[MAX_SCAN_RESULTS];
  size_t seenCount = 0;
  int found = WiFi.scanNetworks(false, true);
  for (int index = 0; index < found && seenCount < MAX_SCAN_RESULTS; index++) {
    String ssid = WiFi.SSID(index);
    if (ssid.length() == 0) {
      continue;
    }
    bool duplicate = false;
    for (size_t check = 0; check < seenCount; check++) {
      if (seen[check] == ssid) {
        duplicate = true;
        break;
      }
    }
    if (duplicate) {
      continue;
    }
    seen[seenCount++] = ssid;
    if (seenCount > 1) {
      json += ",";
    }
    json += "{\"s\":\"" + escapeJson(ssid) + "\",\"r\":" + String(WiFi.RSSI(index)) + "}";
  }
  json += "]";
  WiFi.scanDelete();
  return json;
}

void handleApScan() {
  sendJson(apServer, 200, buildScanJson());
}

void handleDashboardScan() {
  sendJson(dashboardServer, 200, buildScanJson());
}

void handleApNotFound() {
  redirectToRoot(apServer);
}

void handleApNetInfo() {
  sendJson(apServer, 200, currentNetworkJson(WiFi.status() == WL_CONNECTED));
}

void handleApConnectState() {
  sendJson(apServer, 200, connectStateJson());
}

void handleApProbe() {
  if (apServer.method() == HTTP_GET || connectAttempt.active) {
    sendJson(apServer, 200, connectStateJson());
    return;
  }
  String ssid = apServer.arg("ssid");
  ssid.trim();
  if (ssid.length() == 0) {
    sendJson(apServer, 400, "{\"state\":\"fail\",\"reason\":\"ssid\"}");
    return;
  }
  pendingConfig = config;
  copyText(pendingConfig.wifiSsid, sizeof(pendingConfig.wifiSsid), ssid);
  applySecretValue(pendingConfig.wifiPassword, sizeof(pendingConfig.wifiPassword), apServer.arg("wifiPassword"));
  Serial.printf("测试连接 %s\n", pendingConfig.wifiSsid);
  beginConnectAttempt(ConnectJob::Probe, false);
  sendJson(apServer, 200, connectStateJson());
}

void handleDashboardNetInfo() {
  sendJson(dashboardServer, 200, currentNetworkJson(WiFi.status() == WL_CONNECTED));
}

void handleApSave() {
  if (connectAttempt.active) {
    sendSetupPage(apServer, 409, "上一次连接仍在进行，请稍候。", "err");
    return;
  }
  DeviceConfig candidate = config;
  copyText(candidate.wifiSsid, sizeof(candidate.wifiSsid), apServer.arg("ssid"));
  applySecretValue(candidate.wifiPassword, sizeof(candidate.wifiPassword), apServer.arg("wifiPassword"));
  applySecretValue(candidate.apPassword, sizeof(candidate.apPassword), apServer.arg("apPassword"));
  copyText(candidate.staticIp, sizeof(candidate.staticIp), apServer.arg("ip"));
  copyText(candidate.gateway, sizeof(candidate.gateway), apServer.arg("gateway"));
  copyText(candidate.subnet, sizeof(candidate.subnet), apServer.arg("subnet"));
  copyText(candidate.dns, sizeof(candidate.dns), apServer.arg("dns"));
  uint16_t port = 0;
  if (!parsePort(apServer.arg("port"), port)) {
    sendSetupPage(apServer, 400, "Web 端口需为 1-65535 之间的整数。", "err");
    return;
  }
  candidate.webPort = port;
  String ssid = candidate.wifiSsid;
  ssid.trim();
  if (ssid.length() == 0) {
    sendSetupPage(apServer, 400, "请填写或选择 WiFi 名称。", "err");
    return;
  }
  if (strlen(candidate.apPassword) < AP_PASSWORD_MIN_LENGTH) {
    sendSetupPage(apServer, 400, "配置 AP 密码至少需要 8 位。", "err");
    return;
  }
  pendingConfig = candidate;
  Serial.printf("尝试连接 WiFi: %s\n", pendingConfig.wifiSsid);
  beginConnectAttempt(ConnectJob::Save, apServer.arg("autoNet") == "1");
  sendSetupPage(apServer, 200, "正在连接 WiFi，请稍候…", "ok");
}

void startSetupPortal() {
  if (setupPortalActive) {
    return;
  }
  if (serverStarted) {
    dashboardServer.stop();
    serverStarted = false;
  }
  WiFi.mode(WIFI_AP_STA);
  portalHoldUntil = 0;
  bool secured = strlen(config.apPassword) >= 8;
  WiFi.softAP(SETUP_AP_SSID, secured ? config.apPassword : nullptr);  delay(SETUP_AP_CHANNEL_DELAY_MS);
  if (!apRoutesReady) {
    apServer.on("/", HTTP_GET, handleApRoot);
    apServer.on("/scan", HTTP_GET, handleApScan);
    apServer.on("/netinfo", HTTP_GET, handleApNetInfo);
    apServer.on("/connectstate", HTTP_GET, handleApConnectState);
    apServer.on("/probe", HTTP_POST, handleApProbe);
    apServer.on("/probe", HTTP_GET, handleApProbe);
    apServer.on("/save", HTTP_POST, handleApSave);
    apServer.onNotFound(handleApNotFound);
    apRoutesReady = true;
  }
  apServer.begin();
  setupPortalActive = true;
  Serial.printf("配置模式: 连接 %s%s，打开 http://%s\n",
                SETUP_AP_SSID,
                secured ? "（使用已设置的 AP 密码）" : "（无需密码）",
                WiFi.softAPIP().toString().c_str());
}

void stopSetupPortal() {
  if (!setupPortalActive) {
    return;
  }
  apServer.stop();
  WiFi.softAPdisconnect(true);
  setupPortalActive = false;
}

void handleRoot() {
  sendDashboardPage(dashboardServer, 200);
}

bool applyFormConfig(ESP8266WebServer& source, String& error) {
  DeviceConfig candidate = config;
  copyText(candidate.wifiSsid, sizeof(candidate.wifiSsid), source.arg("ssid"));
  applySecretValue(candidate.wifiPassword, sizeof(candidate.wifiPassword), source.arg("wifiPassword"));
  copyText(candidate.staticIp, sizeof(candidate.staticIp), source.arg("ip"));
  copyText(candidate.gateway, sizeof(candidate.gateway), source.arg("gateway"));
  copyText(candidate.subnet, sizeof(candidate.subnet), source.arg("subnet"));
  copyText(candidate.dns, sizeof(candidate.dns), source.arg("dns"));
  copyText(candidate.ddnsHostname, sizeof(candidate.ddnsHostname), source.arg("hostname"));
  copyText(candidate.ddnsUsername, sizeof(candidate.ddnsUsername), source.arg("ddnsUsername"));
  applySecretValue(candidate.ddnsPassword, sizeof(candidate.ddnsPassword), source.arg("ddnsPassword"));
  copyText(candidate.ddnsUrl, sizeof(candidate.ddnsUrl), source.arg("ddnsUrl"));
  copyText(candidate.ddnsProvider, sizeof(candidate.ddnsProvider), source.arg("ddnsProvider"));
  copyText(candidate.aliyunAccessKeyId, sizeof(candidate.aliyunAccessKeyId), source.arg("aliyunAccessKeyId"));
  applySecretValue(candidate.aliyunAccessKeySecret, sizeof(candidate.aliyunAccessKeySecret), source.arg("aliyunAccessKeySecret"));
  copyText(candidate.aliyunDomainName, sizeof(candidate.aliyunDomainName), source.arg("aliyunDomainName"));
  copyText(candidate.aliyunRR, sizeof(candidate.aliyunRR), source.arg("aliyunRR"));
  copyText(candidate.aliyunType, sizeof(candidate.aliyunType), source.arg("aliyunType"));
  applySecretValue(candidate.cloudflareApiToken, sizeof(candidate.cloudflareApiToken), source.arg("cloudflareApiToken"));
  copyText(candidate.cloudflareZoneId, sizeof(candidate.cloudflareZoneId), source.arg("cloudflareZoneId"));
  copyText(candidate.cloudflareRecordId, sizeof(candidate.cloudflareRecordId), source.arg("cloudflareRecordId"));
  copyText(candidate.tencentSecretId, sizeof(candidate.tencentSecretId), source.arg("tencentSecretId"));
  applySecretValue(candidate.tencentSecretKey, sizeof(candidate.tencentSecretKey), source.arg("tencentSecretKey"));
  copyText(candidate.tencentDomain, sizeof(candidate.tencentDomain), source.arg("tencentDomain"));
  copyText(candidate.tencentSubDomain, sizeof(candidate.tencentSubDomain), source.arg("tencentSubDomain"));
  copyText(candidate.tencentRecordType, sizeof(candidate.tencentRecordType), source.arg("tencentRecordType"));
  copyText(candidate.ddnsIpUrl, sizeof(candidate.ddnsIpUrl), source.arg("ddnsIpUrl"));
  copyText(candidate.ddnsSuccess, sizeof(candidate.ddnsSuccess), source.arg("ddnsSuccess"));
  copyText(candidate.ddnsBody, sizeof(candidate.ddnsBody), source.arg("ddnsBody"));
  copyText(candidate.ddnsHeaders, sizeof(candidate.ddnsHeaders), source.arg("ddnsHeaders"));
  normalizeProvider(candidate.ddnsProvider, sizeof(candidate.ddnsProvider));
  normalizeRecordType(candidate.aliyunType, sizeof(candidate.aliyunType));
  normalizeRecordType(candidate.tencentRecordType, sizeof(candidate.tencentRecordType));
  String method = source.arg("ddnsMethod");
  method.toUpperCase();
  copyText(candidate.ddnsMethod, sizeof(candidate.ddnsMethod), method == DDNS_POST ? DDNS_POST : DDNS_GET);
  candidate.tlsInsecure = source.arg("tlsInsecure") == "1" ? 1 : 0;
  uint16_t port = 0;
  if (!parsePort(source.arg("port"), port)) {
    error = "Web 端口需为 1-65535 之间的整数。";
    return false;
  }
  candidate.webPort = port;
  long interval = source.arg("ddnsIntervalSec").toInt();
  if (interval < static_cast<long>(DDNS_INTERVAL_MIN_SEC) || interval > static_cast<long>(DDNS_INTERVAL_MAX_SEC)) {
    error = "DDNS 检查间隔需在 10-604800 秒之间。";
    return false;
  }
  long retry = source.arg("ddnsRetrySec").toInt();
  if (retry < static_cast<long>(DDNS_RETRY_MIN_SEC) || retry > static_cast<long>(DDNS_RETRY_MAX_SEC)) {
    error = "DDNS 失败重试间隔需在 10-3600 秒之间。";
    return false;
  }
  long force = source.arg("ddnsForceSec").toInt();
  if (force < static_cast<long>(DDNS_FORCE_MIN_SEC) || force > static_cast<long>(DDNS_FORCE_MAX_SEC)) {
    error = "DDNS 强制更新间隔需在 600-2592000 秒之间。";
    return false;
  }
  candidate.ddnsIntervalSec = static_cast<uint32_t>(interval);
  candidate.ddnsRetrySec = static_cast<uint32_t>(retry);
  candidate.ddnsForceSec = static_cast<uint32_t>(force);
  applySecretValue(candidate.apPassword, sizeof(candidate.apPassword), source.arg("apPassword"));
  if (strlen(candidate.apPassword) < AP_PASSWORD_MIN_LENGTH) {
    error = "配置 AP 密码至少需要 8 位。";
    return false;
  }
  config = candidate;
  return true;
}

void handleSave() {
  DeviceConfig previous = config;
  String error;
  if (!applyFormConfig(dashboardServer, error)) {
    config = previous;
    sendDashboardPage(dashboardServer, 400, error, "err");
    return;
  }
  applyAddressFallback();
  saveConfig();
  sendDashboardPage(dashboardServer, 200, "配置已保存，设备正在重启。", "ok");
  delay(RESTART_DELAY_MS);
  ESP.restart();
}

void startWebServer() {
  if (serverStarted) {
    return;
  }
  if (!dashboardRoutesReady) {
    dashboardServer.on("/", HTTP_GET, handleRoot);
    dashboardServer.on("/netinfo", HTTP_GET, handleDashboardNetInfo);
    dashboardServer.on("/scan", HTTP_GET, handleDashboardScan);
    dashboardServer.on("/save", HTTP_POST, handleSave);
    dashboardRoutesReady = true;
  }
  dashboardServer.begin(config.webPort);
  serverStarted = true;
  Serial.printf("Web 服务: http://%s:%u\n", WiFi.localIP().toString().c_str(), config.webPort);
}

