lbw14514/esp8266-ddns-console/src/main.cpp
bool waitForNetworkTime(uint32_t timeoutMs);

String replacePlaceholders(String url) {
  url.replace("{hostname}", config.ddnsHostname);
  url.replace("{ip}", currentDdnsIp);
  url.replace("{user}", config.ddnsUsername);
  url.replace("{password}", config.ddnsPassword);
  url.replace("#{domain}", config.ddnsHostname);
  url.replace("#{ip}", currentDdnsIp);
  url.replace("#{recordType}", CALLBACK_RECORD_TYPE);
  url.replace("#{ttl}", CALLBACK_RECORD_TTL);
  return url;
}

String httpGetBody(const String& url, int& status) {
  std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
  configureSecureClient(*client);
  HTTPClient http;
  if (!http.begin(*client, url)) {
    status = -1;
    return "";
  }
  status = http.GET();
  String body = http.getString();
  http.end();
  return body;
}

String fetchPublicIp() {
  if (!config.tlsInsecure && !waitForNetworkTime(5000)) {
    Serial.println("系统时间未就绪，跳过公网 IP 获取");
    return "";
  }
  String urls[DEFAULT_PUBLIC_IP_API_COUNT + 1];
  size_t urlCount = 0;
  if (strlen(config.ddnsIpUrl) > 0) {
    urls[urlCount++] = config.ddnsIpUrl;
  }
  for (size_t index = 0; index < DEFAULT_PUBLIC_IP_API_COUNT; index++) {
    if (urlCount == 0 || urls[0] != DEFAULT_PUBLIC_IP_APIS[index]) {
      urls[urlCount++] = DEFAULT_PUBLIC_IP_APIS[index];
    }
  }
  for (size_t index = 0; index < urlCount; index++) {
    int status = 0;
    String address = httpGetBody(urls[index], status);
    address.trim();
    IPAddress parsed;
    if (status == 200 && parsed.fromString(address)) {
      Serial.printf("公网 IP: %s <- %s\n", address.c_str(), urls[index].c_str());
      return address;
    }
    Serial.printf("公网 IP 接口失败: %s (%d)\n", urls[index].c_str(), status);
  }
  return "";
}

bool ddnsResponseOk(int status, const String& response) {
  if (status < 200 || status >= 300) {
    return false;
  }
  return strlen(config.ddnsSuccess) == 0 || response.indexOf(config.ddnsSuccess) >= 0;
}

void addCallbackHeaders(HTTPClient& http) {
  String headers = replacePlaceholders(config.ddnsHeaders);
  int start = 0;
  while (start < static_cast<int>(headers.length())) {
    int end = headers.indexOf('\n', start);
    if (end < 0) {
      end = headers.length();
    }
    String line = headers.substring(start, end);
    line.trim();
    int separator = line.indexOf(':');
    if (separator > 0) {
      String name = line.substring(0, separator);
      String value = line.substring(separator + 1);
      name.trim();
      value.trim();
      http.addHeader(name, value);
    }
    start = end + 1;
  }
}

String percentEncode(const String& value) {
  const char hex[] = "0123456789ABCDEF";
  String encoded;
  for (size_t index = 0; index < value.length(); index++) {
    unsigned char character = value[index];
    if (isalnum(character) || character == '-' || character == '_' || character == '.' || character == '~') {
      encoded += static_cast<char>(character);
    } else {
      encoded += '%';
      encoded += hex[(character >> 4) & 0x0f];
      encoded += hex[character & 0x0f];
    }
  }
  return encoded;
}

String base64Encode(const uint8_t* data, size_t length) {
  const char alphabet[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  String result;
  for (size_t index = 0; index < length; index += 3) {
    uint32_t block = static_cast<uint32_t>(data[index]) << 16;
    if (index + 1 < length) {
      block |= static_cast<uint32_t>(data[index + 1]) << 8;
    }
    if (index + 2 < length) {
      block |= data[index + 2];
    }
    result += alphabet[(block >> 18) & 0x3f];
    result += alphabet[(block >> 12) & 0x3f];
    result += index + 1 < length ? alphabet[(block >> 6) & 0x3f] : '=';
    result += index + 2 < length ? alphabet[block & 0x3f] : '=';
  }
  return result;
}

String hmacSha1Base64(const String& key, const String& message) {
  br_hmac_key_context keyContext;
  br_hmac_context hmacContext;
  uint8_t digest[20];
  br_hmac_key_init(&keyContext, &br_sha1_vtable, key.c_str(), key.length());
  br_hmac_init(&hmacContext, &keyContext, sizeof(digest));
  br_hmac_update(&hmacContext, message.c_str(), message.length());
  br_hmac_out(&hmacContext, digest);
  return base64Encode(digest, sizeof(digest));
}

void hmacSha256(const String& key, const String& message, uint8_t* output) {
  br_hmac_key_context keyContext;
  br_hmac_context hmacContext;
  br_hmac_key_init(&keyContext, &br_sha256_vtable, key.c_str(), key.length());
  br_hmac_init(&hmacContext, &keyContext, 32);
  br_hmac_update(&hmacContext, message.c_str(), message.length());
  br_hmac_out(&hmacContext, output);
}

String toHex(const uint8_t* data, size_t length) {
  const char hex[] = "0123456789abcdef";
  String result;
  for (size_t index = 0; index < length; index++) {
    result += hex[(data[index] >> 4) & 0x0f];
    result += hex[data[index] & 0x0f];
  }
  return result;
}

String sha256Hex(const String& value) {
  br_sha256_context context;
  uint8_t digest[32];
  br_sha256_init(&context);
  br_sha256_update(&context, value.c_str(), value.length());
  br_sha256_out(&context, digest);
  return toHex(digest, sizeof(digest));
}

String hmacSha256Hex(const String& key, const String& message) {
  uint8_t digest[32];
  hmacSha256(key, message, digest);
  return toHex(digest, sizeof(digest));
}

String utcTimestamp() {
  time_t now = time(nullptr);
  if (now < MIN_VALID_EPOCH) {
    return "";
  }
  struct tm* utc = gmtime(&now);
  char buffer[25];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%SZ", utc);
  return String(buffer);
}

bool waitForNetworkTime(uint32_t timeoutMs) {
  time_t now = time(nullptr);
  uint32_t startedAt = millis();
  while (now < MIN_VALID_EPOCH && millis() - startedAt < timeoutMs) {
    delay(250);
    now = time(nullptr);
  }
  return now >= MIN_VALID_EPOCH;
}

String aliyunCommonParams(const char* action) {
  String params = "AccessKeyId=" + percentEncode(config.aliyunAccessKeyId);
  params += "&Action=";
  params += action;
  params += "&Format=JSON&SignatureMethod=HMAC-SHA1&SignatureNonce=";
  params += makeNonce();
  params += "&SignatureVersion=1.0&Timestamp=" + percentEncode(utcTimestamp());
  params += "&Version=";
  params += ALIYUN_API_VERSION;
  return params;
}

String aliyunRequest(const String& canonicalQuery, int& status) {
  String stringToSign = "GET&%2F&" + percentEncode(canonicalQuery);
  String signature = percentEncode(hmacSha1Base64(String(config.aliyunAccessKeySecret) + "&", stringToSign));
  String url = String(ALIYUN_API_HOST) + canonicalQuery + "&Signature=" + signature;
  return httpGetBody(url, status);
}

