lbw14514/esp8266-ddns-console/src/main.cpp
String aliyunFindRecordId(int& status) {
  String query = aliyunCommonParams("DescribeDomainRecords");
  query += "&DomainName=" + percentEncode(config.aliyunDomainName);
  query += "&RRKeyWord=" + percentEncode(config.aliyunRR);
  query += "&Type=" + percentEncode(config.aliyunType);
  String response = aliyunRequest(query, status);
  if (status != 200) {
    return "";
  }
  DynamicJsonDocument document(4096);
  if (deserializeJson(document, response)) {
    return "";
  }
  for (JsonObject record : document["DomainRecords"]["Record"].as<JsonArray>()) {
    if (String(record["RR"].as<const char*>()) == config.aliyunRR &&
        String(record["Type"].as<const char*>()) == config.aliyunType) {
      return record["RecordId"].as<String>();
    }
  }
  return "";
}

bool aliyunWriteRecord(const String& recordId) {
  String query = aliyunCommonParams("UpdateDomainRecord");
  query += "&RR=" + percentEncode(config.aliyunRR);
  query += "&RecordId=" + percentEncode(recordId);
  query += "&Type=" + percentEncode(config.aliyunType);
  query += "&Value=" + percentEncode(currentDdnsIp);
  int status = 0;
  String response = aliyunRequest(query, status);
  Serial.printf("阿里云 DDNS 更新状态: %d\n", status);
  return status == 200 && response.indexOf("ErrorCode") < 0;
}

bool updateAliyunDdns() {
  if (strlen(config.aliyunAccessKeyId) == 0 || strlen(config.aliyunAccessKeySecret) == 0 ||
      strlen(config.aliyunDomainName) == 0 || strlen(config.aliyunRR) == 0) {
    Serial.println("阿里云 DDNS 配置不完整");
    return false;
  }
  if (!waitForNetworkTime(5000)) {
    Serial.println("尚未获取网络时间，跳过阿里云 DDNS");
    return false;
  }
  int status = 0;
  String recordId = aliyunFindRecordId(status);
  if (recordId.length() == 0) {
    Serial.printf("阿里云未找到匹配 DNS 记录: %d\n", status);
    return false;
  }
  return aliyunWriteRecord(recordId);
}

bool updateCloudflareDdns() {
  if (strlen(config.cloudflareApiToken) == 0 || strlen(config.cloudflareZoneId) == 0 ||
      strlen(config.cloudflareRecordId) == 0 || strlen(config.ddnsHostname) == 0) {
    Serial.println("Cloudflare DDNS 配置不完整");
    return false;
  }
  String url = "https://api.cloudflare.com/client/v4/zones/";
  url += config.cloudflareZoneId;
  url += "/dns_records/";
  url += config.cloudflareRecordId;
  std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
  configureSecureClient(*client);
  HTTPClient http;
  if (!http.begin(*client, url)) {
    Serial.println("Cloudflare API 无法连接");
    return false;
  }
  http.addHeader("Authorization", "Bearer " + String(config.cloudflareApiToken));
  http.addHeader("Content-Type", "application/json");
  StaticJsonDocument<512> payload;
  payload["type"] = CALLBACK_RECORD_TYPE;
  payload["name"] = config.ddnsHostname;
  payload["content"] = currentDdnsIp;
  payload["ttl"] = 120;
  payload["proxied"] = false;
  String body;
  serializeJson(payload, body);
  int status = http.sendRequest("PATCH", body);
  String response = http.getString();
  http.end();
  Serial.printf("Cloudflare DDNS 更新状态: %d\n", status);
  return status == 200 && response.indexOf("\"success\":true") >= 0;
}

String tencentAuthorization(const String& payload, uint32_t timestamp) {
  const String host = DNSPOD_API_NAME;
  const String service = DNSPOD_SERVICE;
  char dateBuffer[12];
  time_t currentTime = static_cast<time_t>(timestamp);
  strftime(dateBuffer, sizeof(dateBuffer), "%Y-%m-%d", gmtime(&currentTime));
  const String date = dateBuffer;
  String canonicalHeaders = "content-type:application/json; charset=utf-8\n";
  canonicalHeaders += "host:" + host + "\n";
  String signedHeaders = "content-type;host";
  String canonicalRequest = "POST\n/\n\n" + canonicalHeaders + "\n" + signedHeaders + "\n" + sha256Hex(payload);
  String credentialScope = date + "/" + service + "/tc3_request";
  String stringToSign = "TC3-HMAC-SHA256\n" + String(timestamp) + "\n" + credentialScope + "\n" + sha256Hex(canonicalRequest);
  String secretDate = hmacSha256Hex("TC3" + String(config.tencentSecretKey), date);
  String secretService = hmacSha256Hex(secretDate, service);
  String secretSigning = hmacSha256Hex(secretService, "tc3_request");
  String signature = hmacSha256Hex(secretSigning, stringToSign);
  return "TC3-HMAC-SHA256 Credential=" + String(config.tencentSecretId) + "/" + credentialScope +
         ", SignedHeaders=" + signedHeaders + ", Signature=" + signature;
}

String tencentRequest(const String& action, const String& payload, int& status) {
  uint32_t timestamp = static_cast<uint32_t>(time(nullptr));
  std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
  configureSecureClient(*client);
  HTTPClient http;
  if (!http.begin(*client, DNSPOD_API_HOST)) {
    status = -1;
    return "";
  }
  http.addHeader("Content-Type", "application/json; charset=utf-8");
  http.addHeader("Host", DNSPOD_API_NAME);
  http.addHeader("X-TC-Action", action);
  http.addHeader("X-TC-Version", DNSPOD_API_VERSION);
  http.addHeader("X-TC-Timestamp", String(timestamp));
  http.addHeader("Authorization", tencentAuthorization(payload, timestamp));
  status = http.POST(payload);
  String response = http.getString();
  http.end();
  return response;
}

bool updateTencentDdns() {
  if (strlen(config.tencentSecretId) == 0 || strlen(config.tencentSecretKey) == 0 ||
      strlen(config.tencentDomain) == 0 || strlen(config.tencentSubDomain) == 0) {
    Serial.println("腾讯云 DDNS 配置不完整");
    return false;
  }
  if (!waitForNetworkTime(5000)) {
    Serial.println("尚未获取网络时间，跳过腾讯云 DDNS");
    return false;
  }
  StaticJsonDocument<384> query;
  query["Domain"] = config.tencentDomain;
  query["Subdomain"] = config.tencentSubDomain;
  query["RecordType"] = config.tencentRecordType;
  String payload;
  serializeJson(query, payload);
  int status = 0;
  String response = tencentRequest("DescribeRecordList", payload, status);
  if (status != 200) {
    Serial.printf("腾讯云查询失败: %d\n", status);
    return false;
  }
  DynamicJsonDocument document(4096);
  if (deserializeJson(document, response) || document["Response"]["Error"].is<JsonObject>()) {
    Serial.println("腾讯云响应解析或 API 返回失败");
    return false;
  }
  JsonArray records = document["Response"]["RecordList"].as<JsonArray>();
  if (records.isNull() || records.size() == 0) {
    Serial.println("腾讯云未找到匹配 DNS 记录");
    return false;
  }
  int recordId = records[0]["RecordId"] | 0;
  StaticJsonDocument<512> update;
  update["Domain"] = config.tencentDomain;
  update["RecordId"] = recordId;
  update["SubDomain"] = config.tencentSubDomain;
  update["RecordLine"] = "默认";
  update["Value"] = currentDdnsIp;
  serializeJson(update, payload);
  response = tencentRequest("ModifyRecord", payload, status);
  Serial.printf("腾讯云 DDNS 更新状态: %d\n", status);
  return status == 200 && response.indexOf("\"Error\"") < 0;
}

bool updateGenericDdns() {
  if (strlen(config.ddnsUrl) == 0) {
    return false;
  }
  String url = replacePlaceholders(config.ddnsUrl);
  std::unique_ptr<BearSSL::WiFiClientSecure> client(new BearSSL::WiFiClientSecure);
  configureSecureClient(*client);
  HTTPClient http;
  if (!http.begin(*client, url)) {
    Serial.println("DDNS URL 无法连接");
    return false;
  }
  addCallbackHeaders(http);
  if (strlen(config.ddnsUsername) > 0) {
    http.setAuthorization(config.ddnsUsername, config.ddnsPassword);
  }
  String method = config.ddnsMethod;
  method.toUpperCase();
  String body = replacePlaceholders(config.ddnsBody);
  int status = http.sendRequest(method.c_str(), body);
  String response = http.getString();
  http.end();
  bool success = ddnsResponseOk(status, response);
  Serial.printf("通用 DDNS 状态: %d\n", status);
  return success;
}

void scheduleDdnsAttempt(bool success) {
  uint32_t delaySeconds = success ? config.ddnsIntervalSec : config.ddnsRetrySec;
  nextDdnsAttempt = millis() + delaySeconds * 1000UL;
}

bool providerSupportsRecordType() {
  if (strcmp(config.ddnsProvider, "aliyun") == 0) {
    return isCallbackRecordType(config.aliyunType);
  }
  if (strcmp(config.ddnsProvider, "dnspod") == 0) {
    return isCallbackRecordType(config.tencentRecordType);
  }
  return true;
}

void updateDdns() {
  if (WiFi.status() != WL_CONNECTED) {
    scheduleDdnsAttempt(false);
    return;
  }
  currentDdnsIp = fetchPublicIp();
  if (currentDdnsIp.length() == 0) {
    Serial.println("公网 IP 获取失败");
    scheduleDdnsAttempt(false);
    return;
  }
  if (!providerSupportsRecordType()) {
    Serial.println("当前记录类型不支持自动更新，已跳过写入");
    lastDdnsIp = currentDdnsIp;
    lastDdnsSync = millis();
    scheduleDdnsAttempt(true);
    return;
  }
  bool forceUpdate = lastDdnsSync == 0 || millis() - lastDdnsSync >= config.ddnsForceSec * 1000UL;
  if (currentDdnsIp == lastDdnsIp && !forceUpdate) {
    Serial.printf("公网 IP 未变化: %s\n", currentDdnsIp.c_str());
    scheduleDdnsAttempt(true);
    return;
  }
  bool success = false;
  if (strcmp(config.ddnsProvider, "aliyun") == 0) {
    success = updateAliyunDdns();
  } else if (strcmp(config.ddnsProvider, "cloudflare") == 0) {
    success = updateCloudflareDdns();
  } else if (strcmp(config.ddnsProvider, "dnspod") == 0) {
    success = updateTencentDdns();
  } else {
    success = updateGenericDdns();
  }
  if (success) {
    lastDdnsIp = currentDdnsIp;
    lastDdnsSync = millis();
    Serial.println("DDNS 同步成功");
  } else {
    Serial.println("DDNS 同步失败，稍后重试");
  }
  scheduleDdnsAttempt(success);
}

bool connectWifi() {
  if (strlen(config.wifiSsid) == 0) {
    return false;
  }
  WiFi.mode(WIFI_STA);
  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE);
  WiFi.begin(config.wifiSsid, config.wifiPassword);
  uint32_t startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < WIFI_CONNECT_TIMEOUT_MS) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();
  if (WiFi.status() != WL_CONNECTED) {
    return false;
  }
  return connectWithAvailableStaticIp();
}
}

void setup() {
  Serial.begin(115200);
  delay(100);
  loadConfig();
  if (connectWifi()) {
    startClock();
    startWebServer();
    updateDdns();
  } else {
    startSetupPortal();
  }
}

void loop() {
  serviceConnectAttempt();
  if (setupPortalActive) {
    apServer.handleClient();
    if (!connectAttempt.active) {
      bool hold = portalHoldUntil != 0 && static_cast<int32_t>(millis() - portalHoldUntil) < 0;
      bool backToConfiguredNetwork = strlen(config.wifiSsid) > 0 &&
                                     WiFi.status() == WL_CONNECTED &&
                                     WiFi.SSID() == String(config.wifiSsid);
      if (!hold && backToConfiguredNetwork) {
        stopSetupPortal();
      }
    }
  } else if (connectAttempt.active) {
    startSetupPortal();
    apServer.handleClient();
  } else if (WiFi.status() == WL_CONNECTED) {
    if (!serverStarted) {
      startClock();
      startWebServer();
      updateDdns();
    }
    dashboardServer.handleClient();
    if (static_cast<int32_t>(millis() - nextDdnsAttempt) >= 0) {
      updateDdns();
    }
  } else {
    if (serverStarted) {
      dashboardServer.stop();
      serverStarted = false;
    }
    if (millis() - lastWifiRetry >= WIFI_RETRY_INTERVAL_MS) {
      lastWifiRetry = millis();
      Serial.println("WiFi 已断开，尝试重连");
      WiFi.reconnect();
    }
    if (millis() - lastWifiRetry >= PORTAL_FALLBACK_DELAY_MS) {
      startSetupPortal();
    }
  }
  delay(2);
}
